## Production: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 7 to add, 3 to change, 4 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                             NAME                                             |
|----------|----------------------------------------------------------------------------------------------|
| add      | `aws_route53_record.form_viewer[1]`                                                          |
|          | `aws_route53_record.form_viewer_certificate_validation[&quot;forms-formulaires.canada.ca&quot;]`       |
|          | `aws_shield_protection.route53_hosted_zone[1]`                                               |
| update   | `aws_lb_listener.form_viewer_https`                                                          |
|          | `aws_wafv2_regex_pattern_set.forms_base_url`                                                 |
|          | `aws_wafv2_regex_pattern_set.valid_app_uri_paths`                                            |
| recreate | `aws_acm_certificate.form_viewer`                                                            |
|          | `aws_route53_record.form_viewer[0]`                                                          |
|          | `aws_route53_record.form_viewer_certificate_validation[&quot;forms-formulaires.alpha.canada.ca&quot;]` |
|          | `aws_shield_protection.route53_hosted_zone[0]`                                               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_acm_certificate.form_viewer must be replaced
+/- resource "aws_acm_certificate" "form_viewer" {
      ~ arn                       = "arn:aws:acm:ca-central-1:957818836222:certificate/71036e98-a054-4f6c-acf5-1024111a9af8" -> (known after apply)
      ~ domain_name               = "forms-formulaires.alpha.canada.ca" -> "forms-formulaires.canada.ca" # forces replacement
      ~ domain_validation_options = [
          - {
              - domain_name           = "forms-formulaires.alpha.canada.ca"
              - resource_record_name  = "_d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_6ea0e0b39a687d606d774852492fb7c2.nfyddsqlcy.acm-validations.aws."
            },
          + {
              + domain_name           = "forms-formulaires.alpha.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "forms-formulaires.canada.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      ~ id                        = "arn:aws:acm:ca-central-1:957818836222:certificate/71036e98-a054-4f6c-acf5-1024111a9af8" -> (known after apply)
      ~ status                    = "ISSUED" -> (known after apply)
      ~ subject_alternative_names = [ # forces replacement
          + "forms-formulaires.alpha.canada.ca",
        ]
        tags                      = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
      ~ validation_emails         = [] -> (known after apply)
        # (2 unchanged attributes hidden)

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # aws_lb_listener.form_viewer_https will be updated in-place
  ~ resource "aws_lb_listener" "form_viewer_https" {
      ~ certificate_arn   = "arn:aws:acm:ca-central-1:957818836222:certificate/71036e98-a054-4f6c-acf5-1024111a9af8" -> (known after apply)
        id                = "arn:aws:elasticloadbalancing:ca-central-1:957818836222:listener/app/form-viewer/ef2ad28d416e7d87/6cbbf9263c624fe9"
        tags              = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer[0] must be replaced
  # (moved from aws_route53_record.form_viewer)
-/+ resource "aws_route53_record" "form_viewer" {
      + allow_overwrite = (known after apply)
      ~ fqdn            = "forms-formulaires.alpha.canada.ca" -> (known after apply)
      ~ id              = "Z1031499PBK3926Y7HKK_forms-formulaires.alpha.canada.ca_A" -> (known after apply)
      ~ name            = "forms-formulaires.alpha.canada.ca" -> "forms-formulaires.canada.ca" # forces replacement
      - records         = [] -> null
      - ttl             = 0 -> null
      ~ zone_id         = "Z1031499PBK3926Y7HKK" -> "mocked_zone_id_forms-formulaires.canada.ca" # forces replacement
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # aws_route53_record.form_viewer[1] will be created
  + resource "aws_route53_record" "form_viewer" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "forms-formulaires.alpha.canada.ca"
      + type            = "A"
      + zone_id         = "mocked_zone_id_forms-formulaires.alpha.canada.ca"

      + alias {
          + evaluate_target_health = true
          + name                   = "form-viewer-1039776084.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-formulaires.alpha.canada.ca"] must be replaced
-/+ resource "aws_route53_record" "form_viewer_certificate_validation" {
      ~ fqdn            = "_d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca" -> (known after apply)
      ~ id              = "Z1031499PBK3926Y7HKK__d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca._CNAME" -> (known after apply)
      ~ name            = "_d790f6dfd9c2ba0c9fa129347a170b4c.forms-formulaires.alpha.canada.ca" # forces replacement -> (known after apply)
      ~ records         = [
          - "_6ea0e0b39a687d606d774852492fb7c2.nfyddsqlcy.acm-validations.aws.",
        ] -> (known after apply)
      ~ type            = "CNAME" -> (known after apply)
      ~ zone_id         = "Z1031499PBK3926Y7HKK" -> "mocked_zone_id_forms-formulaires.alpha.canada.ca" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.form_viewer_certificate_validation["forms-formulaires.canada.ca"] will be created
  + resource "aws_route53_record" "form_viewer_certificate_validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "mocked_zone_id_forms-formulaires.canada.ca"
    }

  # aws_shield_protection.route53_hosted_zone[0] must be replaced
  # (moved from aws_shield_protection.route53_hosted_zone)
-/+ resource "aws_shield_protection" "route53_hosted_zone" {
      ~ arn          = "arn:aws:shield::957818836222:protection/abb8c7ef-5e58-4b87-afe6-2eeb93734f51" -> (known after apply)
      ~ id           = "abb8c7ef-5e58-4b87-afe6-2eeb93734f51" -> (known after apply)
        name         = "Route53HostedZone"
      ~ resource_arn = "arn:aws:route53:::hostedzone/Z1031499PBK3926Y7HKK" -> "arn:aws:route53:::hostedzone/mocked_zone_id_forms-formulaires.canada.ca" # forces replacement
        tags         = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_shield_protection.route53_hosted_zone[1] will be created
  + resource "aws_shield_protection" "route53_hosted_zone" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + name         = "Route53HostedZone"
      + resource_arn = "arn:aws:route53:::hostedzone/mocked_zone_id_forms-formulaires.alpha.canada.ca"
      + tags         = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + tags_all     = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_wafv2_regex_pattern_set.forms_base_url will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "forms_base_url" {
        id          = "e1ceb832-c7e4-4b53-a818-44a55e27b3e4"
        name        = "forms_base_url"
        tags        = {}
        # (5 unchanged attributes hidden)

      - regular_expression {
          - regex_string = "forms-formulaires.alpha.canada.ca$" -> null
        }
      + regular_expression {
          + regex_string = "^forms-formulaires.alpha.canada.ca$"
        }
      + regular_expression {
          + regex_string = "^forms-formulaires.canada.ca$"
        }
    }

  # aws_wafv2_regex_pattern_set.valid_app_uri_paths will be updated in-place
  ~ resource "aws_wafv2_regex_pattern_set" "valid_app_uri_paths" {
        id          = "f3927a12-2101-47c6-9a47-7353ac95ba92"
        name        = "valid_app_uri_paths"
        tags        = {}
        # (5 unchanged attributes hidden)

      + regular_expression {
          + regex_string = "^\\/?(BingSiteAuth\\.xml|googlef34bd8c094c26cb0\\.html)$"
        }

        # (4 unchanged blocks hidden)
    }

Plan: 7 to add, 3 to change, 4 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.firehose_waf_logs,
  on kinesis.tf line 30, in resource "aws_s3_bucket" "firehose_waf_logs":
  30: resource "aws_s3_bucket" "firehose_waf_logs" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.forms_base_url"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_regex_pattern_set.valid_app_uri_paths"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
